app/views/users/hashtags/show.html.erb

                    <%= display_caption %><br>
                    <% if post["hashtags"].present? %>
---
SELECT "post_hashtags".* FROM "post_hashtags"