app/controllers/concerns/hashtag_methods.rb

INSERT INTO "hashtags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "かわいい"], ["created_at", "2021-05-04 16:47:38.544533"], ["updated_at", "2021-05-04 16:47:38.544533"]]
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."name" = ? LIMIT ?  [["name", "かわいい"], ["LIMIT", 1]]
INSERT INTO "post_hashtags" ("post_id", "hashtag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["hashtag_id", 1], ["created_at", "2021-05-04 16:47:38.559415"], ["updated_at", "2021-05-04 16:47:38.559415"]]
---
  def save_hashtag(hashtag_array,post_instance)
    if hashtag_array.blank?
      return
    end

    hashtag_array.uniq.map do |hashtag|
      tag = Hashtag.find_or_create_by(name: hashtag.downcase.delete('#'))

      post_hashtag = PostHashtag.new
      post_hashtag.post_id = post_instance.id
      post_hashtag.hashtag_id = tag.id
      post_hashtag.save!

SELECT "posts".* FROM "posts"
---
  def creating_structures(posts: "",post_hashtags: "",hashtags: "")
      array = [] #最終戻り値用
      posts.each do |post|
        hashtag = [] #中間テーブルのID情報から探したハッシュタグを格納するための配列
        post_hash = post.attributes
        related_hashtag_records = post_hashtags.select{|ph| ph.post_id == post.id }

SELECT "hashtags".* FROM "hashtags"
---
  def delete_records_related_to_hashtag(post_id)
    relationship_records = PostHashtag.where(post_id: post_id)
    if relationship_records
      relationship_records.each do |record|