app/controllers/users/hashtags_controller.rb

SELECT "post_hashtags".* FROM "post_hashtags"
SELECT "posts".* FROM "posts"
---
    def show
        post_hashtags = PostHashtag.all
        relationship_records = post_hashtags.select{ |ph| ph.hashtag_id == params[:id].to_i}.map(&:post_id) #中間テーブルの全レコードより、該当ハッシュタグIDが含まれるものを取得→post_idを配列に格納 #=> [1,3]
        all_posts = Post.all
        @posts = all_posts.select{ |post| relationship_records.include?(post.id)} #中間テーブルの情報が含まれるPostのレコードを取得する