app/controllers/users/posts_controller.rb

  def index
      @posts = Post.all
      @hashtags = Hashtag.all
---
SELECT "posts".* FROM "posts"
SELECT "post_hashtags".* FROM "post_hashtags"

  def show
      @post = Post.find(params[:id])
      related_records = PostHashtag.where(post_id: @post.id).pluck(:hashtag_id) #=> [1,2,3] idのみを配列にして返す
      hashtags = Hashtag.all
      @hashtags = hashtags.select{|hashtag| related_records.include?(hashtag.id)} #hashtagテーブルより中間テーブルで取得したidのハッシュタグを取得。配列に。
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_hashtags"."hashtag_id" FROM "post_hashtags" WHERE "post_hashtags"."post_id" = ?  [["post_id", 1]]
SELECT "hashtags".* FROM "hashtags"

  def create
      @newpost = Post.new(post_params)
      @newpost.user_id = current_user.id
      hashtag = extract_hashtag(@newpost.caption)
      @newpost.save!
---
INSERT INTO "posts" ("user_id", "title", "caption", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "a"], ["caption", "aa"], ["image_id", nil], ["created_at", "2021-05-04 16:47:02.477176"], ["updated_at", "2021-05-04 16:47:02.477176"]]

  def update
      @post = Post.find(params[:id])
      strong_paramater = post_params
      post_params["image"] = @post.image_id if strong_paramater["image"].to_s.length <= 2
      #ハッシュタグの実装には関係ないです。画像情報が空で渡ってきた場合は前に保存してある画像をセットするというものです。
      @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "image_id" = ?, "caption" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_id", nil], ["caption", "#かわいい"], ["updated_at", "2021-05-04 16:47:38.526764"], ["id", 1]]